{
  "fragments": [
    {
      "fragmentId": "108",
      "chapterTitle": "Speaking to Roi",
      "src": null,
      "text": "You leave from the southwest and cross the river onto a seldom-used dirt road. You walk along the road until you reach the path leading into the druid's grove. The path to the grove winds through oldgrowth forest. It's beautiful and peaceful beyond your expectations. Shafts of sunlight pierce the canopy to dapple a forest floor of pillowy moss. Everything is rich brown and shining green.\nBut something is wrong.\nSilence hangs over the wood like a shroud. No birds are singing. No insects are humming in the undergrowth. Not even the distant caw of a raven breaks the stillness. Something is very wrong.\nYou walk through the eerily quiet wood. Sunlight jabs through the canopy, creating little pools of light everywhere. But the lack of sound is unnerving.\nYou go into the woods anyway (go to 122).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "122"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "109",
      "src": null,
      "text": "Success! You and the druid uncover a patch of wild sage and you harvest enough to brew a tea.\nAdd sage to your inventory.\nNext, you need to search out some hornwort (go to 120).",
      "actions": {
        "gainItem": {
          "itemName": "Sage",
          "quantity": 1,
          "description": "Add sage to your inventory."
        },
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "120"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "110",
      "src": null,
      "text": "The wolf looks quizzically at you, clearly confused about what to do next but also not attacking. It flicks its ears and appears lost in thought.\nIf you have any rations in your pack, you could offer some food to the wolf (go to 145). Alternatively, you could try to communicate with the wolf by speaking to it normally (go to 134) or with a spell or ability allowing you to speak with animals (go to 118).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Offer some food (rations)",
              "nextFragmentId": "145"
            },
            {
              "label": "Speak to it normally",
              "nextFragmentId": "134"
            },
            {
              "label": "Use a speak-with-animals ability",
              "nextFragmentId": "118"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "111",
      "src": null,
      "text": "Tomlin sees your point and agrees and gives you the herb for free.\nAdd hornwort to your inventory.\nTomlin also has sage (go to 114) and wolfsbane (go to 157) if you need either one.\nOr if you have all the herbs you need, you can go back to the druid’s grove (go to 140).",
      "actions": {
        "gainItem": {
          "itemName": "Hornwort",
          "quantity": 1,
          "description": "Add hornwort to your inventory."
        },
        "choice": {
          "options": [
            {
              "label": "Get sage",
              "nextFragmentId": "114"
            },
            {
              "label": "Get wolfsbane",
              "nextFragmentId": "157"
            },
            {
              "label": "Return to the druid’s grove",
              "nextFragmentId": "140"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "112",
      "src": null,
      "text": "You try to convince Tomlin of the importance of the herb, and that given everything you’ve done for him so far that you shouldn’t have to pay.\nRoll Charisma (Persuasion) check. If you get 12 or more, go to 111. If you get less than 12, go to 142.",
      "actions": {
        "roll": {
          "stat": "Charisma",
          "skill": "Persuasion",
          "threshold": 12,
          "outcomes": {
            "success": {
              "nextFragmentId": "111",
              "description": "You persuade Tomlin successfully."
            },
            "failure": {
              "nextFragmentId": "142",
              "description": "You fail to persuade Tomlin."
            }
          }
        }
      }
    },
    {
      "fragmentId": "113",
      "src": null,
      "text": "The wolf stares at you for a moment then starts to vibrate. Its form starts to soften, and the bones and muscles move. And then with a sneeze, all motion stops. The druid nods and then stares impatiently at you.\nYou can try to find the herbs yourself (go to 146) or go back to town and get them from Tomlin (go to 127).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Find the herbs yourself",
              "nextFragmentId": "146"
            },
            {
              "label": "Go back to town for Tomlin’s help",
              "nextFragmentId": "127"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "114",
      "src": null,
      "text": "“I have some sage growing in the garden, but part of the trellis has fallen into that plot,” Tomlin says. But he hands you a hammer and some nails. “But many hands make light work. If you could help fix that bit of fence, you can take as much sage as you want.”\nHe leads you out to the garden and to the place that needs repairs. He can’t stay and help, though, as he has something very delicate brewing and he needs to stay near his filtration system.\nRoll a Dexterity check or a proficiency check with carpenter's tools. If you get 10 or more, go to 121. If you get less than 10, go to 148.",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Dexterity check",
              "roll": {
                "stat": "Dexterity",
                "threshold": 10,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "121",
                    "description": "You successfully repair the fence."
                  },
                  "failure": {
                    "nextFragmentId": "148",
                    "description": "You fail to repair the fence."
                  }
                },
                "notes": "If proficient with carpenter's tools, consider advantage."
              }
            },
            {
              "label": "Carpeneter's tools proficiency check",
              "roll": {
                "stat": "CarpenterTools",
                "threshold": 10,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "121",
                    "description": "You successfully repair the fence."
                  },
                  "failure": {
                    "nextFragmentId": "148",
                    "description": "You fail to repair the fence."
                  }
                },
                "notes": "If proficient with carpenter's tools, consider advantage."
              }
            }
          ]
        }
      }
    },
    {
      "fragmentId": "115",
      "src": null,
      "text": "The blood loss is just too much. You collapse. You're just so tired. You just need to take a little rest before you continue on... You just close your eyes for a moment, knowing for sure you’ll be fine after just a short rest.\nYou are dead.",
      "actions": "gameOver"
    },
    {
      "fragmentId": "116",
      "src": null,
      "text": "As you emerge into the clearing, you lose sight of the wolf behind the rocky outcropping for a moment. You're moving cautiously but slip and scuffle on some loose gravel underfoot. You glance down at the offending patch of ground and when you look up, the wolf has vanished.\nPanicking for a moment, you look behind you and all around the clearing, but you cannot spot the animal anywhere.\nThen the wolf trots out from behind the rocky outcropping, its muzzle covered in the blood of whatever - or whoever - it had been eating. It looks at you intently and stretches.\nThen the blood-stained animal stands still, neither advancing nor running away.\nFrom here you can either try to communicate with the wolf (go to 110) or attack it (go to 130).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Try to communicate",
              "nextFragmentId": "110"
            },
            {
              "label": "Attack the wolf",
              "nextFragmentId": "130"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "117",
      "src": null,
      "text": "Despite the interruption, you eventually manage to get back to sleep.\nGet the benefits of a long rest.\nYou wake up not entirely rested, but better off than last night. As you're getting ready for your day, there's a knock at the door.\nAnswer the door (go to 128), draw a weapon and answer the door (go to 162), or ignore the knocking (go to 132).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Answer the door",
              "nextFragmentId": "128"
            },
            {
              "label": "Draw a weapon and answer",
              "nextFragmentId": "162"
            },
            {
              "label": "Ignore the knocking",
              "nextFragmentId": "132"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "118",
      "src": null,
      "text": "You open your mouth to speak, but the wolf cuts you off.\n\"Oh thank the gods,\" it says in a gravelly voice you’re sure you’ve heard before. \"You've come at just the right time, adventurer. Please, visit the herbalist Tomlin. Ask him for a polypox cure. He'll know what to do, and I'll help you with whatever you need when I'm myself again.\"\nYou ask him who he is.\n“Well, I’m the druid of this grove,” he says, barking out a laugh. “Roi Sunderhamer. Normally a dwarf, but since I seem to be down with a case of polypox, I seem to have even more hair than usual. But let’s get down to it. I don’t know how long this spell of yours will last, and it’s taking a lot of effort besides. The blasted polypox is making it hard to think in terms of language.”\nGain Inspiration.\nThe druid in the form of a shaggy wolf goes silent but keeps his attention focused on you (go to 158).",
      "actions": {
        "inspiration": {
          "type": "gainInspiration"
        },
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "158"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "119",
      "src": null,
      "text": "You see no threats, but a threat sees you.\nYou are attacked by a tiny creature that looks like the largest mosquito you've ever seen. It drops out of one of the trees on leathery wings and lunges at you with its long sharp proboscis and six clawed feet.\nIt is a stirge and it has surprised you by hiding in a nearby tree. You may not move or take any actions on the first round of combat (go to 144).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "144"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "120",
      "src": null,
      "text": "The druid leads you to a shallow pond that you never would have noticed without him. This looks like a great place to find wild hornwort. You wade into the water searching for the medicinal weed.\nRoll a Wisdom (Survival) or Intelligence (Nature) check with advantage as Roi is helping. If you get 12 or more, go to 131. If you get less than 12, go to 149.",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Wisdom (Survival) check",
              "roll": {
                "stat": "Wisdom",
                "skill": "Survival",
                "threshold": 12,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "131",
                    "description": "You successfully find the hornwort."
                  },
                  "failure": {
                    "nextFragmentId": "149",
                    "description": "You fail to find the hornwort."
                  }
                },
                "notes": "Roi is helping, so you have advantage."
              }
            },
            {
              "label": "Intelligence (Nature) check",
              "roll": {
                "stat": "Intelligence",
                "skill": "Nature",
                "threshold": 12,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "131",
                    "description": "You successfully find the hornwort."
                  },
                  "failure": {
                    "nextFragmentId": "149",
                    "description": "You fail to find the hornwort."
                  }
                },
                "notes": "Roi is helping, so you have advantage."
              }
            }
          ]
        }
      }
    },
    {
      "fragmentId": "121",
      "src": null,
      "text": "You are able to get the trellis fixed in short order. Tomlin appears just as you’re putting the last nail into the lattice.\nAdd sage to your inventory.\nIf you still need it, you can get hornwort (go to 159) or wolfsbane (go to 157).\nOr if you have all the herbs you need, go to 140.",
      "actions": {
        "gainItem": {
          "itemName": "Sage",
          "quantity": 1,
          "description": "Add sage to your inventory."
        },
        "choice": {
          "options": [
            {
              "label": "Get hornwort",
              "nextFragmentId": "159"
            },
            {
              "label": "Get wolfsbane",
              "nextFragmentId": "157"
            },
            {
              "label": "You have all herbs, return to druid’s grove",
              "nextFragmentId": "140"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "122",
      "src": null,
      "text": "You move unbothered south along the path through the silent woods. Eventually, you reach a clearing. At first you wonder if it’s the druid’s grove, but it’s just a place where the trees have given grass a little room to grow.\nThis seems like a good place to stop for a moment and have a drink from your waterskin, but you do a quick spot-check for threats first.\nRoll an Intelligence (Nature) or Wisdom (Perception) check. If you get 15 or more, go to 155. If you get less than 15, go to 119.",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Intelligence (Nature) check",
              "roll": {
                "stat": "Intelligence",
                "skill": "Nature",
                "threshold": 15,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "155",
                    "description": "You spot the threat."
                  },
                  "failure": {
                    "nextFragmentId": "119",
                    "description": "You fail to spot the threat."
                  }
                }
              }
            },
            {
              "label": "Wisdom (Perception) check",
              "roll": {
                "stat": "Wisdom",
                "skill": "Perception",
                "threshold": 15,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "155",
                    "description": "You spot the threat."
                  },
                  "failure": {
                    "nextFragmentId": "119",
                    "description": "You fail to spot the threat."
                  }
                }
              }
            }
          ]
        }
      }
    },
    {
      "fragmentId": "123",
      "src": null,
      "text": "You strike the wolf one last time and it collapses into the grass of the clearing. It struggles to rise once before collapsing back into the grass.\nBut then its fur starts to recede. Muscle and sinew warp and shift until there is now an equally battered red-haired dwarf lying in its place. Fortunately, it is not a naked dwarf. His clothes seem to grow out of his skin as he changes, buckles and all.\nYou leap forward to lend aid, but you stop short when he starts roaring with laughter.\n\"Did you know?\" he asks, wiping tears of mirth from his eyes.\nYour puzzled expression says it all, and he laughs even harder. He whispers a short incantation as he lays a hand over his more serious wounds. A green glow seeps from between his fingers as he breathes a sigh of relief.\n“Better to be lucky than good, eh?” he says, giving your shoulder a stinging slap. “Never would have occurred to me that if I killed the wolf’s body, I’d return to my own. Guess it didn’t really occur to you either.”\nYou’re about to reply when the dwarf belts out yet another one of those laughs. You figure it’s best to let him finish (go to 129).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "129"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "124",
      "src": null,
      "text": "You return to the inn for a well-deserved rest after a very busy day. You eat a hearty meal alone in the common room before falling into an exhausted sleep.\nYou are troubled by dreams as you sleep. In one, you are attacked by rosebushes that claw at you with their thorns. In another, you are running through the streets on Langston on all fours.\nIn a third, you see the hulking shape that woke you before as it watched you from a nearby rooftop. It bears down on you, but you cross over into a shaft of sunlight.\nAs the dark beast reaches into the light for you, it starts to crack and crumble. Just as it's about to become visible, you wake up with a start.\nYou lie in your bed at the inn. You are alone in the room, and there is nothing outside of the window.\nYou may either try to go back to sleep (go to 117) or get up to keep watch (go to 160).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Go back to sleep",
              "nextFragmentId": "117"
            },
            {
              "label": "Keep watch",
              "nextFragmentId": "160"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "125",
      "src": null,
      "text": "You and the druid work together to find wild sage.\nRoll a Wisdom (Survival) or Intelligence (Nature) with advantage as the druid is helping.\nIf you roll 10 or more, go to 109. If you roll less than 10, go to 152.",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Wisdom (Survival) check",
              "roll": {
                "stat": "Wisdom",
                "skill": "Survival",
                "threshold": 10,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "109",
                    "description": "You successfully find the sage."
                  },
                  "failure": {
                    "nextFragmentId": "152",
                    "description": "You fail to find the sage."
                  }
                },
                "notes": "You have advantage since the druid is helping."
              }
            },
            {
              "label": "Intelligence (Nature) check",
              "roll": {
                "stat": "Intelligence",
                "skill": "Nature",
                "threshold": 10,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "109",
                    "description": "You successfully find the sage."
                  },
                  "failure": {
                    "nextFragmentId": "152",
                    "description": "You fail to find the sage."
                  }
                },
                "notes": "You have advantage since the druid is helping."
              }
            }
          ]
        }
      }
    },
    {
      "fragmentId": "126",
      "src": null,
      "text": "Roi says that the herbalist will certainly have it. There's no rush to get back to him with the cure, but don't be surprised if it's the four-legged version of himself you meet when you return (go to 127).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "127"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "127",
      "src": null,
      "text": "You return to Tomlin’s cottage to get any herbs you’re missing for the polypox cure.\nWhen you arrive, you knock and Tomlin answers alone. You tell him about the polypox cure and let him know that you need sage, hornwort, and wolfsbane for Roi.\n“Ah, well, that shouldn’t be too hard,” he says with a broad smile. “Which one do you need?”\nIf you want to get sage, go to 114. If you still need hornwort, go to 159. Or if you’re missing wolfsbane, go to 157.",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Get sage",
              "nextFragmentId": "114"
            },
            {
              "label": "Get hornwort",
              "nextFragmentId": "159"
            },
            {
              "label": "Get wolfsbane",
              "nextFragmentId": "157"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "128",
      "src": null,
      "text": "You open the door to the innkeeper carrying a steaming tray. He gives you your breakfast and asks if you're doing well.\nThe sun cleric was in the tavern last night. She was asking after you then and today. Will you be visiting her today? She has asked that you come to the temple. It seems that people in town have been talking, and she thinks she can help. You also have this from the mayor’s office. He places a note among your dishes.\nYou thank the innkeeper for the message and the breakfast. You eat as you read the note (go to 164).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "164"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "129",
      "src": null,
      "text": "Roi the druid laughs for a solid minute.\n\"I don't know if you're the smartest or the luckiest adventurer in the world,\" he says. \"But I thank the stars for your help in returning me to my original form. Never thought I’d miss my tangled beard so much!\"\nYou stammer for a moment before he claps you on the back a little too hard.\n\"You're all right, adventurer,\" he booms, then lets out a sneeze that echoes. \"But I'm afraid my relief may be short-lived. I've got polypox, a terrible disease for shapeshifters that makes it impossible to hold our shape. It’s not usually dangerous, but it’s been known to cause some pretty nasty fevers, even to the point of delirium. It’s all here.”\nHe hands you a piece of paper. Add polypox cure to your inventory.\nAs if to prove his point, he breaks out into a sneezing fit. With each outburst of air, Roi’s features shift subtly. His hair bristles, his ears sharpen into points, and his face elongates slightly. Once it stops, he shakes himself like a wet dog and returns to normal.\n“Lucky for me, that cure’s pretty simple: a tea of steeped hornwort, sage, and wolfsbane should do the trick. You can find these here in the woods if you know where to look or get them from Tomlin in town. If you can help me with that, I can help you with whatever it is you came to me for.”\nThen Roi starts to sneeze, but this time he doesn’t stop. He keeps sneezing, violently and with a shake each time, as more of his dwarven appearance fades and the wolf’s appearance reasserts itself.\nYou back up, knowing that you probably can’t catch the illness but not taking any changes.\nWith one final sneeze and a shiver, the same shaggy, reddish wolf is looking up at you. Roi sits on its haunches and whines.\nSearch for the herbs nearby (go to 146) or go to the herbalist (go to 127).",
      "actions": {
        "gainItem": {
          "itemName": "Polypox Cure (Recipe)",
          "quantity": 1,
          "description": "Add polypox cure to your inventory."
        },
        "choice": {
          "options": [
            {
              "label": "Search for the herbs in the woods",
              "nextFragmentId": "146"
            },
            {
              "label": "Go to the herbalist (Tomlin)",
              "nextFragmentId": "127"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "130",
      "src": null,
      "text": "The wolf straightens for a moment then seems to... smile. Then it puts its head down and attacks, tail wagging furiously, and charges you.\nIf the wolf drops to 0 hp, go to 123. If you drop to 0 hp, go to 141.",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Wolf drops to 0 hp",
              "nextFragmentId": "123"
            },
            {
              "label": "You drop to 0 hp",
              "nextFragmentId": "141"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "131",
      "src": null,
      "text": "You manage to find hornwort in the pond. You harvest enough for the cure and set them in your pack.\nAdd hornwort to your inventory.\nNext, you need to find some wolfsbane (go to 133).",
      "actions": {
        "gainItem": {
          "itemName": "Hornwort",
          "quantity": 1,
          "description": "Add hornwort to your inventory."
        },
        "choice": {
          "options": [
            {
              "label": "Find wolfsbane",
              "nextFragmentId": "133"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "132",
      "src": null,
      "text": "You do not respond to the knock and you eventually hear the sound of crockery getting thunked down on the floor. The smell of salted pork and what seems to be a sweet potato porridge wafts up from under the door.\nYou retrieve your breakfast and start to eat. On your tray is a small note written in a tight, controlled hand that you read while you break your fast (go to 164).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "164"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "133",
      "src": null,
      "text": "Wolfsbane should be in season, but given its toxic nature, it’s unlikely that Roi cultivates it near the grove. You may have to find a sunny clearing somewhere further into the woods.\nRoll a Wisdom (Survival) or Intelligence (Nature) check with advantage as the druid is helping. If you get 15 or more, go to 154. If you get less than 15, go to 139.",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Wisdom (Survival) check",
              "roll": {
                "stat": "Wisdom",
                "skill": "Survival",
                "threshold": 15,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "154",
                    "description": "You find wolfsbane."
                  },
                  "failure": {
                    "nextFragmentId": "139",
                    "description": "You fail to find wolfsbane."
                  }
                },
                "notes": "Roi is helping, so you have advantage."
              }
            },
            {
              "label": "Intelligence (Nature) check",
              "roll": {
                "stat": "Intelligence",
                "skill": "Nature",
                "threshold": 15,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "154",
                    "description": "You find wolfsbane."
                  },
                  "failure": {
                    "nextFragmentId": "139",
                    "description": "You fail to find wolfsbane."
                  }
                },
                "notes": "Roi is helping, so you have advantage."
              }
            }
          ]
        }
      }
    },
    {
      "fragmentId": "134",
      "src": null,
      "text": "The wolf in the Druid’s grove seems unusually intent on you and responsive to your actions. You wonder out loud if it can understand you.\nIt nods.\nYou ask who - or what - the wolf is and why it can understand you.\nIt trots over to the living area under the rock outcropping and noses around a pile of tattered clothes. A moment later, it comes trotting back with a wooden druidic holy symbol. It drops the symbol at your feet.\nYou have found the druid (go to 158).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "158"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "135",
      "src": null,
      "text": "Gain Inspiration.\n“I can't rightly say when I got sick,” he says. “But I’m pretty sure I started feeling a bit sniffly around the new moon. Took a couple weeks to start sneezing and changing, though.”\nYou continue questioning Roi about whether or not he has any amnesia.\n“Far as I can tell, there's no gaps in my memory. Wasn't even sneezing or anything by the time the moon was full. Only just today did I have the first uncontrollable change.”\n\"Am I a suspect now?\" But he doesn't wait for an answer, just throws his head back and laughs.\nYou ask if the polypox has anything to do with werewolves, then.\n“A werewolf - any lycanthrope - can definitely get polypox, but just be a carrier. It’s tough to say. But I do know it’s a bloodborne disease, and I haven’t been fighting anything with fur these past months. Probably that old stirge in the woods infected me. It got me pretty good one time.”\nFinally, you ask if Maybelline died on the night of the full moon.\n“Now that you mention it, yes. That young lady died right around then. Maybe even on the night of the full moon. So you may be on to something there.”\nFrom here you can ask Roi more about the scrapling claw you took from Tomlin’s house (go to 163) or say goodbye and return to town for a rest (go to 124).",
      "actions": {
        "inspiration": {
          "type": "gainInspiration"
        },
        "choice": {
          "options": [
            {
              "label": "Ask about the scrapling claw",
              "nextFragmentId": "163"
            },
            {
              "label": "Return to town for a rest",
              "nextFragmentId": "124"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "136",
      "src": null,
      "text": "You don’t have any money to pay for the herb, but you barter something from your pack to get it.\nRemove an item worth at least 5 sp from your inventory. Add hornwort to your inventory.\nYou can still get sage (go to 114) or wolfsbane (go to 157) if you don’t have them yet.\nOr if you have all the herbs you need, you can go back to the druid’s grove (go to 140).",
      "actions": {
        "gainItem": {
          "itemName": "Hornwort",
          "quantity": 1,
          "description": "You barter something worth 5 sp. Add hornwort to your inventory."
        },
        "choice": {
          "options": [
            {
              "label": "Get sage",
              "nextFragmentId": "114"
            },
            {
              "label": "Get wolfsbane",
              "nextFragmentId": "157"
            },
            {
              "label": "Return to druid’s grove",
              "nextFragmentId": "140"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "137",
      "src": null,
      "text": "Gain Inspiration.\nAs you approach, the large wolf goes back to chewing at something bloody in the grass. The wolf does not seem to be aware of your presence as you get closer, but you can see that the wolf’s meal is a dead rabbit.\nThere is also something odd about the wolf’s movements. It is going about eating the rabbit gingerly, as if not used to the taste, even whimpering a little. And it seems to be avoiding the choicest innards for the meatier haunches.\nYou know something has to be wrong when the wolf returns to the druid’s home and takes a jar off the rough-hewn table. It then places the jar next to the rabbit, stares at it for a moment, and then kicks white granules from the jar onto the carcass. The beast takes another bite, visibly shrugs, and goes back to eating the rabbit.\nIt was salt. The wolf just seasoned its meal.\nYou can surprise attack the wolf (go to 151) or make your presence known (go to 156).",
      "actions": {
        "inspiration": {
          "type": "gainInspiration"
        },
        "choice": {
          "options": [
            {
              "label": "Surprise attack the wolf",
              "nextFragmentId": "151"
            },
            {
              "label": "Make your presence known",
              "nextFragmentId": "156"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "138",
      "src": null,
      "text": "Gain Inspiration.\nYou knock the little bloodsucker out of the air. It falls to the ground, twitches a couple times and then lies still.\nThis clearing still seems like a good place to take a rest. As you rest, however, the sound does not return to the woods. The stirge was not the cause of the unease.\nGain the benefits of a short rest.\nWhen you are ready to move on, you continue on towards the druid’s grove (go to 150).",
      "actions": {
        "inspiration": {
          "type": "gainInspiration"
        },
        "choice": {
          "options": [
            {
              "label": "Continue on towards the druid’s grove",
              "nextFragmentId": "150"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "139",
      "src": null,
      "text": "You search everywhere, but you can't find the wolfsbane you need.\nTo get the wolfsbane and any other ingredients that are still missing, go to Tomlin in town (go to 127).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Go to Tomlin in town",
              "nextFragmentId": "127"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "140",
      "src": null,
      "text": "When you arrive in the grove, Roi is waiting for you in wolf form.\nHe helps you find a battered teapot in his kitchen cubby and you brew him a tea from the medicinal herbs. Looking for a teacup, you can't find one and just pour the steaming, bitter brew into a bowl of questionable cleanliness. This doesn't seem to bother the druid, as he laps up the medicine. After finishing the bowl, the druid lies down, and you follow suit, finding a comfortable place on the ground to sit.\nAfter about an hour or so, the wolf's form starts to ripple and shift. Roi gets up and paces, a low whine escaping his throat. With a rustling sound like wind in tall grass, the fur recedes back into his skin. His limbs groan and pop as they shorten and twist back into his natural shape. Eventually, Roi ceases to be a wolf and changes back into a dwarf who smiles broadly at you despite a red nose and watery eyes.\n“Ah that’s so much better,” he says, wiping his nose with his sleeve. “Snot and all. That’s a first for me. Polypox isn’t easy to catch. It's a bloodborne disease, and while there was that elderly stirge in the wood after being abandoned by its swarm, it couldn't have gone far. So there was some other shapeshifter nearby that passed the disease. Maybe some doppelganger traveling in disguise or a lycanthrope passing through one night. Must be slipping.”\nHe thanks you profusely and says he wants to return the favor with a gift. He unclasps the silver starburst brooch on his chest. And presents it to you.\n“This is the Silverstar,” he says. “A gift from an old cleric friend of mine, Solaine’s predecessor at the temple. Since we druids have problems removing curses, he thought it would be helpful. Still haven’t used it, but maybe you can find a use for it.”\nAdd Silverstar to your inventory.\nThe druid is happy to have you back anytime you need anything, but at the moment he badly needs a rest. Before you return to Langston you can ask him a few last questions.\nAsk Roi about the scrapling claw (go to 163) or ask Roi if he had polypox before or after Maybelline’s death (go to 135).",
      "actions": {
        "gainItem": {
          "itemName": "Silverstar",
          "quantity": 1,
          "description": "Add Silverstar to your inventory."
        },
        "choice": {
          "options": [
            {
              "label": "Ask about the scrapling claw",
              "nextFragmentId": "163"
            },
            {
              "label": "Ask if he had polypox before or after Maybelline’s death",
              "nextFragmentId": "135"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "141",
      "src": null,
      "text": "Though the wolf has been unusually slow and clumsy you think, it still manages to bite and scratch you into the ground. You black out...\nBut that is not the end. After an unknown period of darkness, you come to with a gasp. In front of you, you see an injured dwarf with red hair pulling his hands back from you.\nYou feel the fading tingle of healing magic, and you know now that you've found the druid. You're feeling as groggy as expected following a neardeath experience. The dwarf before you also seems to have been in a fight, even clutching an obviously broken arm to his side.\nYou are now at 1 hp.\nAt the sight of your confusion, he belly laughs loud enough to echo off the trees.\n“You’re half lucky, adventurer,” he says. “Stroke of accidental genius trying to kill me like that!”\nIt dawns on you that this is the wolf you fought. The realization must have shown on your face because the dwarf nods and grins.\n“But only half lucky because even when I was pulling my punches, I managed to put you down. Still got it, eh? Eh?” He bobs and weaves behind upraised fists before wincing and cradling his broken arm again. “But you helped me figure out that if I killed the wolf, I’d return. Not an ideal solution, but it did the trick.”\nHe starts laughing again (go to 129).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "129"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "142",
      "src": null,
      "text": "Tomlin is kind and apologetic, but he insists that you need to pay.\nPay Tomlin 1 sp for the herb (go to 153) or trade something worth at least 5 sp for the herb (go to 136).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Pay 1 sp for the herb",
              "nextFragmentId": "153"
            },
            {
              "label": "Trade item worth 5 sp",
              "nextFragmentId": "136"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "143",
      "src": null,
      "text": "You slip off the trail and into the nearby woods, taking care to keep yourself hidden and stepping on the soft moss.\nAs you approach the grove, your position shifts to reveal the wolf chewing at something in the grass. Then even at this distance, you hear the crackling and crunching of breaking bones. The wolf raises its head, its muzzle bloody and a ragged strip of flesh in its teeth. It swallows without really chewing and renews its unseen meal.\nTo try to sneak up on the wolf, roll a Dexterity (Stealth) check at disadvantage. If you roll 13 or higher, go to 137. If you roll less than 13, go to 116.\nAlternatively, you could just approach the wolf (go to 156) or attack it (go to 151).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Dexterity (Stealth) check (disadvantage)",
              "roll": {
                "stat": "Dexterity",
                "skill": "Stealth",
                "threshold": 13,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "137",
                    "description": "You successfully sneak up on the wolf."
                  },
                  "failure": {
                    "nextFragmentId": "116",
                    "description": "You fail to sneak up on the wolf."
                  }
                },
                "notes": "Roll at disadvantage."
              }
            },
            {
              "label": "Approach the wolf",
              "nextFragmentId": "156"
            },
            {
              "label": "Attack the wolf",
              "nextFragmentId": "151"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "144",
      "src": null,
      "text": "The stirge is some unholy union between bat and mosquito, but it also looks worse for wear. Its wings are haggard and there are some ragged edges about it.\nLacking color, the tiny creature is obviously ravenous. It fights you to the death.\nIf you reduce the stirge to 0 hp, go to 138. If you drop to 0 hp, go to 115.",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Stirge drops to 0 hp",
              "nextFragmentId": "138"
            },
            {
              "label": "You drop to 0 hp",
              "nextFragmentId": "115"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "145",
      "src": null,
      "text": "You pull some rations out of your pack and put it on the ground for the wolf to eat.\nRemove 1 ration from your inventory. Gain Inspiration.\nThe wolf sniffs at what you’ve offered and then takes a bite. It nods in appreciation as it snaps and snuffles through the meal. When it finishes, it sits on its haunches licking its lips and nodding. It looks to you expectantly.\nUse a spell or ability to speak with animals (go to 118) or just speak to the wolf normally (go to 134).",
      "actions": {
        "removeItem": {
          "itemName": "Ration",
          "quantity": 1,
          "description": "Remove 1 ration from your inventory."
        },
        "inspiration": {
          "type": "gainInspiration"
        },
        "choice": {
          "options": [
            {
              "label": "Use speak-with-animals ability",
              "nextFragmentId": "118"
            },
            {
              "label": "Speak to the wolf normally",
              "nextFragmentId": "134"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "146",
      "src": null,
      "text": "The wolf motions with its head to follow and leads you to a patch of woods where it sits down and yips. Clearly, this is where you're meant to start. As you approach, the druid starts sniffing at the ground, so he’s clearly here to help. His heightened senses will probably be valuable in finding what he needs, and you’re there to help him harvest the ingredients.\nYou start by looking for sage (go to 125).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Look for sage",
              "nextFragmentId": "125"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "147",
      "src": null,
      "text": "Under Tomlin's watchful eye, you manage to safely collect the wolfsbane.\nAdd wolfsbane to your inventory.\nIf you’re still missing an herb for the cure, you can still get sage (go to 114) or hornwort (go to 159). Or if you have everything you need, you can return to the druid’s grove (go to 140).",
      "actions": {
        "gainItem": {
          "itemName": "Wolfsbane",
          "quantity": 1,
          "description": "Add wolfsbane to your inventory."
        },
        "choice": {
          "options": [
            {
              "label": "Get sage",
              "nextFragmentId": "114"
            },
            {
              "label": "Get hornwort",
              "nextFragmentId": "159"
            },
            {
              "label": "Return to the druid’s grove",
              "nextFragmentId": "140"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "148",
      "src": null,
      "text": "You manage to get the sage, but it was not an easy build and you are battered, bruised, and scraped.\nAdd sage to your inventory. Take 1 damage.\nIf you still need more herbs, you can get hornwort (go to 159) or wolfsbane (go to 157) from Tomlin. Or if you have all the herbs you need, go to 140.",
      "actions": {
        "gainItem": {
          "itemName": "Sage",
          "quantity": 1,
          "description": "Add sage to your inventory."
        },
        "damage": {
          "hp": 1,
          "description": "Take 1 damage from the mishap."
        },
        "choice": {
          "options": [
            {
              "label": "Get hornwort",
              "nextFragmentId": "159"
            },
            {
              "label": "Get wolfsbane",
              "nextFragmentId": "157"
            },
            {
              "label": "Return to druid’s grove (all herbs)",
              "nextFragmentId": "140"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "149",
      "src": null,
      "text": "Despite your best efforts, you can't find the hornwort you need. You just get wet.\nBut you haven't looked for wolfsbane yet (go to 133).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Look for wolfsbane",
              "nextFragmentId": "133"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "150",
      "src": null,
      "text": "After twisting and turning a little way through the woods and calming down after your run-in with the stirge, you reach the edge of the trees above what could only be the druid's home.\nThe woods open up into a pasture dotted with wildflowers. A craggy outcropping of stone juts up from the center, and it looks like there's a small kitchen area set up under an overhang along with a hammock, a table, and a chest. It looks like a naturally occurring lean-to or a cottage with most of the walls missing. The druid is nowhere to be seen.\nYou can clearly see that the grove is occupied, however. Near the outcropping, you can see a medium-sized wolf. The animal is stocky and slightly red in color and hasn’t noticed you yet, though it raises its head to sniff at the air from time to time.\nTry to sneak into the grove (go to 143). Just stride into the grove (go to 156).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Try to sneak into the grove",
              "nextFragmentId": "143"
            },
            {
              "label": "Just stride into the grove",
              "nextFragmentId": "156"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "151",
      "src": null,
      "text": "You catch the ferocious animal by surprise. When you go to the next section, the wolf cannot move or take any actions in the first round of combat (go to 130).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "130"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "152",
      "src": null,
      "text": "Despite your best efforts, you can't find the wild sage you need.\nBut you haven't looked for hornwort yet (go to 120).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Look for hornwort",
              "nextFragmentId": "120"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "153",
      "src": null,
      "text": "Add hornwort to your inventory. Remove 1 sp from your inventory.\nTomlin thanks you very much for your understanding.\nIf you still need them, you can still get sage (go to 159) or wolfsbane (go to 157). Or if you have all the herbs you need, you can go back to Roi’s grove (go to 140).",
      "actions": {
        "gainItem": {
          "itemName": "Hornwort",
          "quantity": 1,
          "description": "Add hornwort to your inventory."
        },
        "removeItem": {
          "itemName": "SilverPiece",
          "quantity": 1,
          "description": "Remove 1 sp from your inventory."
        },
        "choice": {
          "options": [
            {
              "label": "Get sage",
              "nextFragmentId": "159"
            },
            {
              "label": "Get wolfsbane",
              "nextFragmentId": "157"
            },
            {
              "label": "Return to Roi’s grove",
              "nextFragmentId": "140"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "154",
      "src": null,
      "text": "You managed to find the wolfsbane and carefully collect a number of parts of the plant carefully to not get any of the toxins into your eyes or face.\nAdd wolfsbane to your inventory.\nIf you’ve collected all the ingredients for the polypox cure, Roi in wolf form darts ahead of you to the grove (go to 140). If you are missing ingredients, then you can get what’s missing from Tomlin in town while Roi remains here (go to 127).",
      "actions": {
        "gainItem": {
          "itemName": "Wolfsbane",
          "quantity": 1,
          "description": "Add wolfsbane to your inventory."
        },
        "choice": {
          "options": [
            {
              "label": "Return to the grove (all ingredients)",
              "nextFragmentId": "140"
            },
            {
              "label": "Go to Tomlin in town (missing ingredients)",
              "nextFragmentId": "127"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "155",
      "src": null,
      "text": "Lounging in a nearby tree, you see a single tiny beast. With leathery wings folded over a rounded body, its long sharp proboscis dips as it dozes. It's holding itself in the tree with clawed legs.\nIt's a stirge, and while it hadn't noticed you enter the clearing, it sees you now. Remarkably, however, you have a clear shot.\nIf you have a ranged attack, you can attack once with advantage as a surprise round. It approaches within melee range in the first round (go to 144).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Continue to combat",
              "nextFragmentId": "144"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "156",
      "src": null,
      "text": "You enter the grove without any attempt to hide your presence. This druid clearly enjoys the sun as the grove is a large clearing. Clumps of flowers - both wild and cultivated - dot the space and the stone outcropping-turned-cabin stands at the center of the natural beauty around you.\nAs you approach, the wolf - much more powerfullooking up close - stalks into view from behind the druid’s home. Its head is down and its hackles are up, but it’s not baring its teeth at you. As you and the wolf look at each other, you also see that its muzzle is smeared and speckled with what appears to be fresh blood.\nYou can either approach the wolf peacefully (go to 110) or attack it (go to 130).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Approach the wolf peacefully",
              "nextFragmentId": "110"
            },
            {
              "label": "Attack it",
              "nextFragmentId": "130"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "157",
      "src": null,
      "text": "“Ah, I have lots of dried wolfsbane, but I can’t handle it right now.” Tomlin shows you a bandaged hand. “Hurt myself in the fight against the scraplings. That’s a poisonous flower and I wouldn’t want to get any of its toxins in an open wound.”\nInstead, he leads you to his cottage and points at the bundles of the flower drying in the window, inviting you to collect some yourself.\nRoll a Wisdom (Medicine) or Dexterity check. If you get 15 or more, go to 147. If you get less than 15, go to 161.",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Wisdom (Medicine) check",
              "roll": {
                "stat": "Wisdom",
                "skill": "Medicine",
                "threshold": 15,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "147",
                    "description": "You safely collect the wolfsbane."
                  },
                  "failure": {
                    "nextFragmentId": "161",
                    "description": "You fail and possibly harm yourself."
                  }
                }
              }
            },
            {
              "label": "Dexterity check",
              "roll": {
                "stat": "Dexterity",
                "threshold": 15,
                "outcomes": {
                  "success": {
                    "nextFragmentId": "147",
                    "description": "You safely collect the wolfsbane."
                  },
                  "failure": {
                    "nextFragmentId": "161",
                    "description": "You fail and possibly harm yourself."
                  }
                }
              }
            }
          ]
        }
      }
    },
    {
      "fragmentId": "158",
      "src": null,
      "text": "You ask the druid to revert back to his dwarven shape, but he woefully shakes his head.\nHe trots towards the home built under the outcropping, clearly requesting you follow. The inside is as joyfully sloppy as the dwarf himself. The druid in wolf form pads around for a few minutes until he jams his snout into a box of scrolls.\nAfter gingerly lifting a few out and unfurling them, the druid places a paw on one.\nYou read:\n\"Polypox; or, Doppleganger's Curse\nPolypox is a bloodborne disease that affects those who can innately change their sahpe - doppelagengers, dragons if they contract it, and even unfortunate members of Druidic Circles. It causes sporadic, uncontrollable shapeshifts that persist as long as the disease itself, which can last weeks before recovery.\nIn extreme cases, delirium and even memory loss can occur.\"\n\nFollowing the description of the disease, there's a recipe for a decoction including wolfsbane, sage, and hornwort. You ask if these herbs grow nearby, and the druid nods. You also ask if the herbalist will have them, and get another emphatic nod.\nYou ask if you can take this page from the book and the wolf nods.\nAdd polypox cure recipe to your inventory.\nAsk if the druid is sure it’s polypox (go to 113). You could either look for the herbs yourself (go to 146) or get them from the herbalist (go to 127).",
      "actions": {
        "gainItem": {
          "itemName": "Polypox Cure Recipe",
          "quantity": 1,
          "description": "Add polypox cure recipe to your inventory."
        },
        "choice": {
          "options": [
            {
              "label": "Ask if the druid is sure it’s polypox",
              "nextFragmentId": "113"
            },
            {
              "label": "Look for the herbs yourself",
              "nextFragmentId": "146"
            },
            {
              "label": "Get them from the herbalist",
              "nextFragmentId": "127"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "159",
      "src": null,
      "text": "As hornwort is an aquatic plant, Tomlin can't grow it himself and needs to get some from his stock. He’s expecting a shipment, but it’s in high demand. He asks that you help him cover the costs of collecting the herb.\nPay Tomlin 1 sp for the herb (go to 153) or trade something worth at least 5 sp for the herb (go to 136).\nIf you don’t want to pay, however, you can also try to persuade Tomlin to give it to you for free (go to 112).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Pay 1 sp",
              "nextFragmentId": "153"
            },
            {
              "label": "Trade item worth at least 5 sp",
              "nextFragmentId": "136"
            },
            {
              "label": "Persuade Tomlin",
              "nextFragmentId": "112"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "160",
      "src": null,
      "text": "It's an uneventful night. You don't get nearly as much rest as you would have liked.\nGet the benefits of a short rest. Gain Inspiration.\nOnce the sun has risen, someone starts knocking at the door.\nAnswer the door (go to 128), draw a weapon before opening the door (go to 162), or ignore the knocking (go to 132).",
      "actions": {
        "inspiration": {
          "type": "gainInspiration"
        },
        "choice": {
          "options": [
            {
              "label": "Answer the door",
              "nextFragmentId": "128"
            },
            {
              "label": "Draw a weapon before opening",
              "nextFragmentId": "162"
            },
            {
              "label": "Ignore the knocking",
              "nextFragmentId": "132"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "161",
      "src": null,
      "text": "Though you're not entirely sure how you did it, you managed to get some of the wolfsbane in your mouth.\nRoll a Constitution save. If you roll 12 or more, you suffer no ill effects. If you rolls less than 12, you are poisoned until you make a successful save. You may re-attempt the save after any short rest or long rest.\n“Oh, bad luck,” Tomlin says. “The general store also has anti-toxin for sale. I’d give you some, but I’m all out.”\nAdd wolfsbane to your inventory.\nIf you go to the general store here or at any other time, remember to note the section you’re coming from.\nIf you need sage (go to 114) or hornwort (go to 159), Tomlin still has both.\nOr if you have everything you need, you can return to Roi to help cure his polypox (go to 140).",
      "actions": {
        "roll": {
          "stat": "Constitution",
          "threshold": 12,
          "outcomes": {
            "success": {
              "description": "You suffer no ill effects."
            },
            "failure": {
              "description": "You are poisoned until you succeed on a future save."
            }
          }
        },
        "gainItem": {
          "itemName": "Wolfsbane",
          "quantity": 1,
          "description": "Add wolfsbane to your inventory."
        },
        "choice": {
          "options": [
            {
              "label": "Get sage",
              "nextFragmentId": "114"
            },
            {
              "label": "Get hornwort",
              "nextFragmentId": "159"
            },
            {
              "label": "Return to Roi (all herbs)",
              "nextFragmentId": "140"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "162",
      "src": null,
      "text": "Weapon in hand, you throw the door open.\nYou scare the innkeeper and he nearly drops the tray with your breakfast on it.\nAfter he hands you your food, he stands around for a moment. When you ask if there's anything else, he says that there was something that he wanted to say but can't remember. Seems you scared the wits out of him.\nHe’s just stumbling out the door when he remembers that the mayor sent you a message. You take the paper out of his trembling hand, reading it while you eat and the innkeeper escapes your room (go to 164).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "164"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "163",
      "src": null,
      "text": "You ask if this could have been the killer, and Roi shakes his head.\n\"Not a chance. This is a wee little thing. You should look at what’s left of the girl. You'll see that these poor victims were mauled by some beasts much larger than this.\"\nBut this could still be of some use. He asks for the claw.\nYou hand it over and Roi binds it with some leather from nearby, chanting softly in the Druidic language as he goes. Light-yellow motes of energy coalesce around the limb whose claws are now tightly bound in a leather strap.\nHe hands you the dismembered limb. The scrapling claw will act as a magic club +1 for the next week. At the end of the week, however, its magic will fade.\n“I hope that helps you for a bit, adventurer,” Roi says. “Now until I see you next, I must rest.”\nIf you haven’t asked yet, you can still find out when he got sick (go to 135). Or if you want to give him some rest, you can return to the inn to also get some rest (go to 124).",
      "actions": {
        "gainItem": {
          "itemName": "Scrapling Claw (Magic Club +1)",
          "quantity": 1,
          "description": "Acts as a magic club +1 for one week."
        },
        "choice": {
          "options": [
            {
              "label": "Ask when he got sick",
              "nextFragmentId": "135"
            },
            {
              "label": "Return to the inn for rest",
              "nextFragmentId": "124"
            }
          ]
        }
      }
    },
    {
      "fragmentId": "164",
      "chapterEnd": true,
      "src": null,
      "text": "The note is a square piece of paper with neatly cut edges.\n\"There is a new lead that you will need to follow. Come to town hall.\" \nChecking both sides of the paper, there is nothing else (go to 165).",
      "actions": {
        "choice": {
          "options": [
            {
              "label": "Continue",
              "nextFragmentId": "165"
            }
          ]
        }
      }
    }
  ]
}
